Revit 2024 API
DataExchangeMessageSeverity Enumeration
 Error levels for DataExchangeLog
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum DataExchangeMessageSeverity
Visual Basic
Public Enumeration DataExchangeMessageSeverity
Visual C++
public enum class DataExchangeMessageSeverity
Members
Member name | Description
Info |  Informational message, such as successful creation fo a face, edge or a solid.
Warning |  A potential problem. The converted data should be carefully examined and/or compared to the source data
Error |  A problem. The converted data should be carefully examined and/or compared to the source data. The application may want to cancel the conversion process.
FatalError |  A serious problem that makes further data conversion pointless. The conversion process will be cancelled.
See Also
Autodesk.Revit.DB Namespace